#define _CRT_SECURE_NO_DEPRECATE

#include <stdio.h>
#include <conio.h>

#include <stdlib.h>
#define _USE_MATH_DEFINES

#include <math.h>
#include <locale.h>

int main() {
	int array[30][6] = {
	{6, 0, 8, 0, 4, 0},
	{0, 8, 0, 3, 0, 4},
	{8, 0, 4, 0, 5, 0},
	{0, 6, 0, 2, 0, 3},
	{10, 0, 12, 0, 10, 0},
	{0, 8, 0, 6, 0, 10},
	{15, 0, 10, 0, 12, 0},
	{0, 10, 0, 8, 0, 0},
	{6, 0, 4, 0, 3, 0},
	{0, 8, 0, 4, 0, 3},
	{10, 0, 6, 0, 8, 0},
	{0, 6, 0, 4, 0, 8},
	{10, 0, 8, 0, 6, 0},
	{0, 12, 0, 8, 0, 6},
	{6, 0, 4, 0, 6, 0},
	{0, 10, 0, 8, 0, 8},
	{4, 0, 6, 0, 1, 0 },
	{0, 15, 0, 10, 0, 6},
	{6, 0, 8, 0, 4, 0},
	{0, 2, 0, 3, 0, 4},
	{10, 0, 12, 0, 6, 0},
	{0, 6, 0, 4, 0, 6},
	{4, 0, 3, 0, 8, 0},
	{0, 8, 0, 10, 0, 6},
	{5, 0, 6, 0, 2, 0},
	{0, 4, 0, 3, 0, 4},
	{5, 0, 8, 0, 3, 0},
	{0, 6, 0, 5, 0, 4},
	{10, 0, 5, 0, 8, 0},
	{0, 2, 0, 1, 0, 3}, };
	int a, b;
	setlocale(LC_ALL, "RUS");
	int v = 1;
	while (v) {
		printf("¬ыберите нужный вариант:\n1) “аблица результатов соревнований \n2) ѕравила присваивани€ очков\n3)«авершить работу программы\n¬ы выбрали пункт: ");
		scanf_s("%d", &a);
		printf("\n");;
		printf("¬ведите кол-во команд:");
		scanf_s("%d", &b);
		switch (a) {
		case 1:
			for (int i = 1; i < 7; i++) {
				printf("\t\tЁтап %d", i);
			}
			for (int i = 1; i <= b; i++) {
				printf("\n\n");
				for (int j = 0; j < 6; j++) {
					if (j == 0) {
						if (array[i - 1][j] == 0) {
							printf("”частник %d", i);
						}
						else {
							printf("”частник %d \t %d", i, array[i - 1][j]);
						}
					}
					else {
						if (array[i - 1][j] == 0) {
							printf("\t");
						}
						else {
							printf("%27d", array[i - 1][j]);
						}
					}
				}
			}
			printf("\n\n");

			break;
		case 2:
			printf("ћеста пересчитываютс€ в очки по правилу: —хема проста€ : 1 - е место Ц 15 очков, 2 - е Ц 12, 3 - е Ц 10, 4 - е Ц 8, 5 - е Ц 6, 6 - е Ц 5, 7 - е Ц 4, 8 - е Ц 3, 9 - е Ц 2 и 10 - е Ц 1.");
			break;
		case 3:
			exit(EXIT_SUCCESS);
			break;
		}


	}
}